app/controllers/posts_controller.rb

  def create
    @post = Post.new(title: params[:post][:title], body: params[:post][:body])
    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", ""], ["body", ""], ["created_at", "2016-05-02 18:39:32.726035"], ["updated_at", "2016-05-02 18:39:32.726035"]]

  def update
    @post = Post.find(params[:id])
    if @post.update(title: params[:post][:title], body: params[:post][:body])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 11]]
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "sdfg"], ["updated_at", "2016-05-02 19:04:47.139545"], ["id", 11]]